app/controllers/api/v1/cows_controller.rb

  def index
  	render json: Cow.all.as_json(include: :calves)
---
SELECT "calves".* FROM "calves" WHERE "calves"."cow_id" = $1  [["cow_id", 1]]
SELECT "cows".* FROM "cows"

  def show
    if cow = Cow.find_by_id(params[:id])
---
SELECT  "cows".* FROM "cows" WHERE "cows"."id" = $1 LIMIT 1  [["id", 1]]